# FabricationPartInvalidConnection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationPartInvalidConnection Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Fabrication Part connection invalid and could not be automatically coupled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationPartInvalidConnection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartInvalidConnection As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationPartInvalidConnection {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace